Ran Plan for project: `platform/jenkins/bhunyd_apnortheast2` dir: `terraform/platform/jenkins/bhunyd_apnortheast2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.kms_apne2: Reading...
data.terraform_remote_state.vpc: Read complete after 1s
data.terraform_remote_state.kms_apne2: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.jenkins.aws_efs_file_system.volume will be created
+ resource "aws_efs_file_system" "volume" {
      + arn                             = (known after apply)
      + availability_zone_id            = (known after apply)
      + availability_zone_name          = (known after apply)
      + creation_token                  = (known after apply)
      + dns_name                        = (known after apply)
      + encrypted                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + name                            = (known after apply)
      + number_of_mount_targets         = (known after apply)
      + owner_id                        = (known after apply)
      + performance_mode                = (known after apply)
      + provisioned_throughput_in_mibps = 8
      + size_in_bytes                   = (known after apply)
      + tags                            = {
          + "Name"    = "jenkins-efs-bhunyd_apnortheast2"
          + "Project" = "jenkins-preprod"
        }
      + tags_all                        = {
          + "Name"    = "jenkins-efs-bhunyd_apnortheast2"
          + "Project" = "jenkins-preprod"
        }
      + throughput_mode                 = "provisioned"
    }

  # module.jenkins.aws_efs_mount_target.mount_target[0] will be created
+ resource "aws_efs_mount_target" "mount_target" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-0b8f4d9e883d0b5da"
    }

  # module.jenkins.aws_efs_mount_target.mount_target[1] will be created
+ resource "aws_efs_mount_target" "mount_target" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-05345ef107042e8c3"
    }

  # module.jenkins.aws_lb.external[0] will be created
+ resource "aws_lb" "external" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "jenkins-bhunydapne2-ext"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0296fc396e742ace4",
          + "subnet-07f9cc7c9dcc17571",
        ]
      + tags                                                         = {
          + "Name"    = "jenkins-bhunyd_apnortheast2-external-lb"
          + "Project" = "jenkins-preprod"
        }
      + tags_all                                                     = {
          + "Name"    = "jenkins-bhunyd_apnortheast2-external-lb"
          + "Project" = "jenkins-preprod"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.jenkins.aws_lb_listener.external_443[0] will be created
+ resource "aws_lb_listener" "external_443" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ap-northeast-2:633309913072:certificate/414253d7-1cdd-48e5-b76c-47c60a0b7edc"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.jenkins.aws_lb_target_group.external[0] will be created
+ resource "aws_lb_target_group" "external" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "180"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "jenkins-bhunydapne2-ext"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 30
      + tags                               = {
          + "Name"    = "jenkins-bhunyd_apnortheast2-external-tg"
          + "Project" = "jenkins-preprod"
        }
      + tags_all                           = {
          + "Name"    = "jenkins-bhunyd_apnortheast2-external-tg"
          + "Project" = "jenkins-preprod"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0e437f8adc6609c4f"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 10
          + matcher             = "200"
          + path                = "/login"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }
    }

  # module.jenkins.aws_route53_record.jenkins_regional_ext_dns[0] will be created
+ resource "aws_route53_record" "jenkins_regional_ext_dns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jenkins"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z07035479QJK8Q5DK72E"
    }

  # module.jenkins.aws_security_group.efs will be created
+ resource "aws_security_group" "efs" {
      + arn                    = (known after apply)
      + description            = "jenkins efs sg for bhunyd_apnortheast2"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 2049
            },
        ]
      + name                   = "jenkins-efs-bhunyd_apnortheast2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "jenkins-efs-bhunyd_apnortheast2"
          + "Project" = "jenkins-preprod"
        }
      + tags_all               = {
          + "Name"    = "jenkins-efs-bhunyd_apnortheast2"
          + "Project" = "jenkins-preprod"
        }
      + vpc_id                 = "vpc-0e437f8adc6609c4f"
    }

  # module.jenkins.aws_security_group.external_lb[0] will be created
+ resource "aws_security_group" "external_lb" {
      + arn                    = (known after apply)
      + description            = "jenkins external LB SG"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "210.183.46.191/32",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "jenkins-bhunyd_apnortheast2-ext"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "jenkins-bhunyd_apnortheast2-ext"
          + "Project" = "jenkins-preprod"
        }
      + tags_all               = {
          + "Name"    = "jenkins-bhunyd_apnortheast2-ext"
          + "Project" = "jenkins-preprod"
        }
      + vpc_id                 = "vpc-0e437f8adc6609c4f"
    }

  # module.jenkins.aws_security_group.jenkins will be created
+ resource "aws_security_group" "jenkins" {
      + arn                    = (known after apply)
      + description            = "jenkins Instance Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 50000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 50000
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "jenkins-bhunyd_apnortheast2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "jenkins-bhunyd_apnortheast2-sg"
          + "Project" = "jenkins-preprod"
        }
      + tags_all               = {
          + "Name"    = "jenkins-bhunyd_apnortheast2-sg"
          + "Project" = "jenkins-preprod"
        }
      + vpc_id                 = "vpc-0e437f8adc6609c4f"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform/jenkins/bhunyd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-645292925.ap-northeast-2.elb.amazonaws.com/lock?id=sehoon99%252Fterraform-provisioning%252Fterraform%252Fplatform%252Fjenkins%252Fbhunyd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform/jenkins/bhunyd_apnortheast2`
</details>
Plan: 10 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
